// ННГУ, ВМК, Курс "Методы программирования-2", С++, ООП
//
// sample_matrix.cpp - Copyright (c) Гергель В.П. 07.05.2001
//   Переработано для Microsoft Visual Studio 2008 Сысоевым А.В. (20.04.2015)
//
// Тестирование верхнетреугольной матрицы

#include <iostream>
#include "Claster.h"
//---------------------------------------------------------------------------

void main()
{
    Claster Y(3,20);
    Y.model_start(10);
    for (int i = 0; i < Y.Getsize(); i++)
    {
        cout<<"процессору "<<i<<" осталось работать "<<Y.Getwork()[i]<< "тактов" <<" , пустовал "<< Y.Getstop()[i]<<" тактов"<< endl;
    }
    cout << "Число отказов " << Y.Getfailure() << endl;
}
//---------------------------------------------------------------------------
